[
  {
    "type": "Mobile Development",
    "order": 0,
    "skills":
            [
              {
                "name": "Android Development",
                "icon": "android",
                "description": "I've started Android development since 2010 as a hobby and while I haven't been a full time Android developer for long periods of time, I have continued to follow the Android development scene.\n\nMy first real Android project was a 6 months long prototype development in 2010-2011 for an application able to help students to organize their homework schedule. At that time, Android latest version was only Gingerbread and the tools were far from being as powerful as today's. There were a lot of limitations in the APIs too.\n\nDuring my three years as the CTO at Appturbo, I was also in charge of developing and maintaining the Android version of App of the Day. I used the power of the Android platform to not only port the iOS version but to also add powerful custom analytics suited to the Appturbo business (which couldn't be done on iOS due to the SDK limitations). The application received a major overhaul in 2015 with a brand new Material Design, a lot of new functionalities for the user and the integration of other analytics SDKs like Facebook, Fabric...\n\nI watch the Google I/O every year and I follow a lot of Android development communities on Google+\n\nSkills:\n- Android Studio and gradle build system\n- Android SDK (Java)\n- Lot of sensibility on design and UX (lot of interest in Google Material Design)\n- Knowledge of popular useful third-party libraries like Glide, Volley, Picasso, Gson...\n- Android Testing with JUnit and Espresso\n- Firebase Cloud Messaging and AppEngine Backend"
              }
            ]
  }
  ,
  {
    "type": "Programming Languages",
    "order": 10,
    "skills":
            [
              {
                "name": "Java",
                "icon": "java",
                "description": "I have started Java development since University as it was the main programming language in my classes. At first, I used it mainly for Java SE applications but since 2010 I use it for Android development"
              },
              
              {
                "name": "C#",
                "icon": "csharp",
                "description": "I started to build C# and .NET Windows applications at University. Since I joined Rakuten in 2016, I use it to build APIs and websites with ASP.NET/ASP.NET Core. It's currently my favourite programming language."
              },
              {
                "name": "Ruby",
                "icon": "ruby",
                "description": "I have started to learn Ruby in 2014 in order to build Websites with frameworks like Ruby on Rails or Sinatra because I was looking for an alternative to PHP. While I have no professional experience with it, I have started using it for my personal blog/sites."
              },
              {
                "name": "PHP",
                "icon": "php",
                "description": "PHP is the first programming language I have learned to build dynamic websites. I have used it in a professional environment during 3 years at Appturbo starting in 2012 with the CodeIgniter framework and later with Symfony 2 and Silex."
              },
              {
                "name": "Python",
                "icon": "python",
                "description": "I have learned Python during the internship of my last year in University and immediately loved it. I have used it intensively for those 6 months when I was working on a semantic and syntaxic parser. I still use it for AppEngine backends and sometimes for small sysadmin tools."
              }
            ]
  },
  {
    "type": "Web Development",
    "order": 20,
    "skills":
            [
              {
                "name": "ASP.NET/Core",
                "icon": "asp",
                "description": "I work with ASP.NET to build REST APIs and Websites deployed to Microsoft Azure at Rakuten. Those applications often interact with MSSQL, Azure Table Storage, Redis or NoSQL Azure DocumentDB. They are unit tested with xUnit.\nSince 2016, I use ASP.NET Core when possible to be able to run on Linux Servers/Docker containers"
              },
              {
                "name": "Ruby on Rails",
                "icon": "ror",
                "description": "I use Ruby on Rails for several of my recent personal web projects."
              },
              {
                "name": "Sinatra",
                "icon": "sinatra",
                "description": "Sinatra was my first DSL of choice to discover Web Development in Ruby. It's lightweight, has less 'magic' than Rails which is good when you are a newcomer to Ruby. I use it for small sites and blogs without database.\n\nFor example I currently have a blog powered by Sinatra which parses all the data from markdown files and uses an asset pipeline to process Sass and Javascript files.\n\nI also have a Sinatra boilerplate I reuse and improve which is accessible here:\nhttps://github.com/FabriceMk/sinatra-noribento"
              },
              {
                "name": "CodeIgniter",
                "icon": "codeigniter",
                "description": "CodeIgniter was a very popular PHP framework several years ago before Symfony or Laravel became widely used. It's a bit outdated now but it served its purpose during the first 2 years of Appturbo (2012) by having a quick learning curve and by being by far more maintenable than using barebones PHP or building a custom framework."
              },
              {
                "name": "Symfony 2",
                "icon": "symfony",
                "description": "Symfony 2 was introduced at Appturbo in 2014 to rebuild some internal web applications written with CodeIgniter. The framework was chosen for both its functionalities and its popularity in France. It allowed the developers to build experience with larger Web frameworks, facilitate modularity and testing, usage of ORM etc... I mainly worked with Symfony 2 on a large REST API which was consumed by a SPA written in Angular.js 1.x"
              },
              {
                "name": "Javascript / Typescript",
                "icon": "javascript",
                "description": "I use Javascript/Typescript mainly to build Front-end applications in Angular 2 or using Vue.js"
              },
              {
                "name": "Sass",
                "icon": "sass",
                "description": "All the recent web projects I have worked on use Sass for CSS preprocessing, either by an asset pipeline or by a workflow tool like gulp.js or Webpack"
              },
              {
                "name": "Microsoft Azure",
                "icon": "azure",
                "description": "For all ASP.NET related developments, I use the Azure infrastructure: Apps Services, Webjobs, DocumentDB, Azure Storage, API Management, Traffic Manager, Azure Active Directory etc...\nI also use the power of Azure for scalability, Blue-Green deployments, georeplication etc..."
              },
              {
                "name": "Google Cloud Platform",
                "icon": "gcp",
                "description": "I have used AppEngine with both Java and Python for some Proofs of Concept and benchmarking at Appturbo.\nI currently mainly use Google Cloud Platform for my personal projects like Google AppEngine in conjunction with Firebase to build Android applications backends"
              }
            ]
  }
  ,
  {
    "type": "Tools",
    "order": 30,
    "skills":
            [
              {
                "name": "Git",
                "icon": "git",
                "description": "Git has become a vital tool for development as an necessity for source code versioning and I often use it with powerful platforms like Github and a good team workflow (Pull Requests, Code Review)."
              },
              {
                "name": "IntelliJ IDEA",
                "icon": "intellij",
                "description": "I have started using IntelliJ IDEA in 2013 with additional plugins to give it the same functionalities as RubyMine, PHPStorm, PyCharm and WebStorm. So all my development in Ruby, PHP, Python or Javascript is done with this IDE."
              },
              {
                "name": "Android Studio",
                "icon": "androidstudio",
                "description": "Android Studio is based on IDEA so I became familiar with it quickly and I use it for all my Android projects."
              },
              {
                "name": "Visual Studio",
                "icon": "visualstudio",
                "description": "I use Visual Studio for all .NET and C# related development especially ASP.NET/Core."
              },
              {
                "name": "Photoshop",
                "icon": "photoshop",
                "description": "While I'm not a graphist I use Photoshop for other passions (photography, drawing) so I know the basics."
              }
            ]
  },
  {
    "type": "Other Skills",
    "order": 40,
    "skills":
            [
              {
                "name": "Artificial Intelligence",
                "icon": "ai",
                "description": "Artificial Intelligence has a lot of different fields and during my Master in University of Paris 6 I had the occasion to study several of them. My favourites are Constraint Programming and Natural Language Processing.\n\nThe internship of my last year was about a conversational agent which had a powerful syntaxic and semantic parser using differents tools from Knowledge Engineering and NLP (like OWL, RDF).\n\nAlso the first Android application I had to create at ILObjects was for a scheduling problem and was solved by implementing a custom Constraint Solver."
              },
              {
                "name": "Linux System Administration",
                "icon": "sysadmin",
                "description": "I'm not a full sysadmin but I have managed dedicated Linux servers for several years for basic use-cases like Apache/SQL and FTP.\n\nAt Appturbo, before switching to Amazon AWS I had to manage 10 dedicated servers for our architecture. From installing new servers, securing them to some extent, configuring the backup solutions and doing their maintenance."
              }
            ]
  },
  {
    "type": "Spoken Languages",
    "order": 50,
    "skills":
    [
      {
        "name": "French",
        "icon": "lang_fr",
        "description": "Native"
      },
      {
        "name": "English",
        "icon": "lang_en",
        "description": "Full Professional Proficiency. TOEIC score: 990"
      },
      {
        "name": "Japanese",
        "icon": "lang_jp",
        "description": "Conversational level. JLPT N3 officially obtained in 2015."
      }
    ]
  }


]
