[
  {
    "company": "Rakuten",
    "position": "Software Engineer",
    "startDate": "2016-02-15",
    "endDate": "Now",
    "icon": "rakuten",
    "header": "rakuten",
    "description": "I have joined Rakuten as a full-stack developer in the Rakuten Mobile Ecosystem Department",
    "details": "Wanting to discover a new working experience abroad, I joined Rakuten in Tokyo. I integrated the Mobile Ecosystem Department and am currently affected to the Mobile Services Team where I am developping REST services and internal websites\n\nSkills and technologies involved:\n- C# and ASP.NET WebAPI/MVC\n- Node.js with Restify\n- HTML5/jQuery/Sass",
    "website": "http://www.rakuten.com"
  },
  {
    "company": "Appturbo",
    "position": "CTO/Lead Developer",
    "startDate": "2012-03-05",
    "endDate": "2015-03-27",
    "icon": "appturbo",
    "header": "appturbo",
    "description": "As a CTO, I have set up the IT team (5-10 people), the IT infrastructure and the different development methods. I was in charge of the strategic decisions for the IT department and ensure that the IT could support the rapid growth of the company.\n\nI also have mainly worked as a Back-end Lead Developer (PHP/MySQL, CodeIgniter) and as the main Android Developer using Java.",
    "details": "Appturbo is a french startup specialized in Mobile Aquisition and is one of the successful App Discovery platform and was founded in 2011 with only 5 employees.\n\nAs a CTO, me and my team were responsible of developping the products and the technical tools needed for the company and its success.\n\nThe main product 'App of the Day' has today 30+ millions of users, the company has now more than 50 employees of 15 different nationalities.\n\nAlongside our mobile applications, we developped powerful internal tools: CRM, prospection tools, optimization tools and Business Intelligence reporting tools. The objective was to simplify the work for all the other departments when possible and give them a lot of structured and coherent data to help them to take the best decisions.\n\nI was also responsible of the architecture, technologies choices and also the sysadmin of our Linux servers\n\nSkills and technologies involved:\n- Android development\n- PHP Back-end development. Frameworks: CodeIgniter, Silex, Symfony2\n- REST APIs\n- Scrum\n- Software conception\n- Linux System administration",
    "website": "http://www.appturbo.com"
  },
  {
    "company": "ILObjects",
    "position": "Software Engineer",
    "startDate": "2010-09-01",
    "endDate": "2012-03-01",
    "icon": "",
    "header": "",
    "description": "As a Software Engineer I have developed an Android application dedicated to students having work scheduling problems.\n\nI also have worked on the conception of a professional software aimed to Industrial Products Designers. The software aimed to visualize and edit Conceptual Graphs",
    "details": "ILObjects was a startup company affiliated with the LIP6 (Laboratoire d'Informatique de Paris 6). It collaborated with the AI departments to create software solutions based on those research works.\n\nFor example I have developped an Android application linked to a school intranet which could suggests ideal homework schedule for the student and were based on his strengths/weaknesses. The app used a specific learning algorithm created by LIP6 researchers that could adapt to the student during the year. Some specific constraints could also be applied.\n\nSkills involved:\n- Android development\n- Java\n- Machine Learning\n- UI/UX",
    "website": ""
  },
  {
    "company": "AsAnAngel",
    "position": "Software Engineer Internship",
    "startDate": "2009-04-01",
    "endDate": "2009-10-01",
    "icon": "",
    "header": "",
    "description": "I have worked on the refactoring and the optimization of a syntax and semantic parser written in Python for an advanced chatterbot. This chatterbot used many techniques from Artificial Intelligence in several domains: NLP, Knowledge Engineering and Semantic Web",
    "details": "AsAnAngel was a startup company specialized in Artificial Intelligence especially on Natural Language Processing.\nDuring this internship, I learned the Python language to work on the core engine of an advanced chatterbot technology. This engine could extract a lot of informations from sentences written in English like detecting jokes, irony and various emotions.\n\nThe engine had an extensive use of various technologies and tools used in NLP: Ontologies modelling through RDF-OWL, lexical databases like Wordnet.\n\nSkills involved:\n- Python\n- Ontologies modeling\n- Natural Language Understanding\n- Linguistics\n- Question answering",
    "website": ""
  }
]
