[
  {
    "type": "Mobile Development",
    "order": 0,
    "skills":
            [
              {
                "name": "Android Development",
                "icon": "android",
                "description": "I've started Android development since 2010 as a hobby and while I haven't been a full time Android developer for long periods of time, I have continued to follow the Android development scene.\n\nMy first real Android project was a 6 months long prototype development in 2010-2011 for an application able to help students to organize their homework schedule. At that time, Android latest version was only Gingerbread and the tools were far from being as powerful as today's. They were a lot of limitations in the APIs too.\n\nDuring my three years as the CTO at Appturbo, I was also in charge of developing and maintaining the Android version of App of the Day. I used the power of the Android platform to not only port the iOS version but to also add powerful custom analytics suited to the Appturbo business (which couldn't be done on iOS due to the SDK limitations). The application received a major update in 2015 with a brand new Material Design, a lot of new functionalities for the user and the integration of other analytics SDKs like Facebook, Fabric...\n\nI watch the Google I/O every year and I follow a lot of Android development communities on Google+\n\nSkills:\n- Android Studio and gradle build system\n- Android SDK (Java)\n- Lot of sensibility on design and UX (lot of interest in Google Material Design)\n- Knowledge of popular useful third-party libraries like Glide, Volley, Picasso, Gson...\n- Android Testing with JUnit and Espresso\n- Google Cloud Messenging and AppEngine Backend"
              }
            ]
  }
  ,
  {
    "type": "Programming Languages",
    "order": 10,
    "skills":
            [
              {
                "name": "Java",
                "icon": "java",
                "description": "I have developed in Java since University where it was the main programming language in classes. At first it was for Java SE applications but since 2010 I use it mainly for Android development"
              },
              {
                "name": "Ruby",
                "icon": "ruby",
                "description": "I have started to learn Ruby in 2014 in order to build Websites with frameworks like Ruby on Rails or Sinatra because I was looking for an alternative to PHP. While I have no professional experience with it, I have started using it for my personal blog/sites and I want to learn more about it as I find it elegant in many ways."
              },
              {
                "name": "PHP",
                "icon": "php",
                "description": "PHP is the first programming language I have learned to build dynamic websites. I have started using it in a professional environment in 2012 with the CodeIgniter framework and more recently with Symfony 2 and Silex."
              },
              {
                "name": "Python",
                "icon": "python",
                "description": "I have learned Python during the internship of my last year in University and immediately loved it. I have used it intensively for those 6 months when I was working on a semantic and syntaxic parser. Lately I didn't have the chance to use it except for one backend project on Google AppEngine when I was at Appturbo. I also use it sometimes for small sysadmin tools."
              }
            ]
  },
  {
    "type": "Web Development",
    "order": 20,
    "skills":
            [
              {
                "name": "Ruby on Rails",
                "icon": "ror",
                "description": "I only learned Ruby on Rails recently on a personal project. I already used an equivalent framework in PHP: Symfony2 but learning Rails is important for me as I would like to switch my Web Development skills to Ruby."
              },
              {
                "name": "Sinatra",
                "icon": "sinatra",
                "description": "Sinatra was my first DSL of choice to discover Web Development in Ruby. It lightweight, less 'magic' than Rails which is good when you are a newcomer to Ruby. I use it for small sites and blogs without database.\n\nFor example I have currently a blog powered by Sinatra,  which parses all the data from markdown files. It also uses the Slim templating engine and an asset pipeline to process Sass and Javascript files.\n\nI also have a Sinatra boilerplate I reuse and improve which is accessible here:\nhttps://github.com/FabriceMk/sinatra-noribento"
              },
              {
                "name": "CodeIgniter",
                "icon": "codeigniter",
                "description": "CodeIgniter was a very popular PHP framework several years ago before Symfony or Laravel became widely used. It's a bit outdated now but it served its purpose during the first 2 years of Appturbo by having a quick learning curve and by being by far more maintenable than using from scratch PHP or building a custom framework."
              },
              {
                "name": "HTML",
                "icon": "html",
                "description": "I'm not a front developer but of course I have to manipulate HTML when building  internal tools/CRMs.\n\nI also have quickly worked on a Google Polymer 0.5 simple application during Summer 2015. The objective was to learn more about the possible future of HTML apps with Web Components (Custom elements, Shadow DOM, HTML imports and HTML templates)."
              },
              {
                "name": "Javascript",
                "icon": "javascript",
                "description": "Being mainly a back-end developer I have not used Javascript a lot except for some jQuery. I have broken the ice with it a little bit with a small Polymer application but I still need to learn more. I would like to try some things with node.js someday."
              },
              {
                "name": "Sass",
                "icon": "sass",
                "description": "All the recent web projects I have worked on use Sass for CSS preprocessing, either by an asset pipeline or by a workflow tool like gulp.js"
              },
              {
                "name": "Amazon Web Services",
                "icon": "aws",
                "description": "Amazon offers a large panel of Web Services. At Appturbo, we began using AWS and hosting some of our tools and backends on Elastic Beanstalk in order to decrease the number of our own dedicated servers which needed too much maintenance. We also used DynamoDB to store all the analytics collected by our Android application."
              },
              {
                "name": "Google App Engine",
                "icon": "gae",
                "description": "I have used AppEngine with both Java and Python for some Proofs of Concept and benchmarking at Appturbo. The main usage I have now with AppEngine is through the AppEngine Backend and Android Studio to create a REST API and automatically generate the Android client compatible with it."
              }
            ]
  }
  ,
  {
    "type": "Tools",
    "order": 30,
    "skills":
            [
              {
                "name": "Git",
                "icon": "git",
                "description": "Git has become a vital tool for development as an necessity for source code versioning and I really enjoy it when used with powerful platforms like Github and a good team workflow (Pull Requests, Code Review)."
              },
              {
                "name": "IntelliJ",
                "icon": "intellij",
                "description": "I have started using IntelliJ IDEA 2 years ago with additional plugins to give it the same functionalities as RubyMine, PHPStorm, PyCharm and WebStorm. So all the Web development I do is with an IntelliJ IDE. Android Studio is also based on IDEA so I became pretty much familiar with it."
              },
              {
                "name": "Gulp",
                "icon": "gulp",
                "description": "I use gulp.js to automatize some tasks like generating CSS from Sass files or minify js files for production when not using an asset pipeline for the web projects I work on."
              },
              {
                "name": "Photoshop",
                "icon": "photoshop",
                "description": "While I'm not a graphist I use Photoshop for other passions (photography, drawing) so I know the basics."
              }
            ]
  },
  {
    "type": "Other Skills",
    "order": 40,
    "skills":
            [
              {
                "name": "Artificial Intelligence",
                "icon": "ai",
                "description": "Artificial Intelligence has a lot of different fields and during my Master in University of Paris 6 I had the occasion to study some of them. My favourites are Constraint Programming and Natural Language Processing.\n\nThe internship of my last year was about a conversational agent which had a powerful syntaxic and semantic parser using differents tools from Knowledge Engineering and NLP (like OWL, RDF).\n\nAlso the first Android application I had to create at ILObjects was for a scheduling problem and was solved by implementing a custom Constraint Solver."
              },
              {
                "name": "Linux System Administration",
                "icon": "sysadmin",
                "description": "I'm not a full sysadmin but I have managed dedicated Linux servers for several years for basic use-cases like Apache/SQL and FTP.\n\nAt Appturbo, before switching to Amazon AWS I had to manage 10 dedicated servers for our architecture. From installing new servers, securing them to some extent, configuring the backup solutions and doing their maintenance."
              }
            ]
  },
  {
    "type": "Spoken Languages",
    "order": 50,
    "skills":
    [
      {
        "name": "French",
        "icon": "fr",
        "description": "Native"
      },
      {
        "name": "English",
        "icon": "en",
        "description": "Full Professional Proficiency"
      },
      {
        "name": "Japanese",
        "icon": "jp",
        "description": "Conversational level. JLPT N3 officially obtained in 2015.\n\nFrom April 2015 to September 2015, I have attended the Coto Language Academy school in Iidabashi (Tokyo) for a 6 months intensive course with 3 hours every weekday in small classes of 5 people."
      }
    ]
  }


]
